
[
    {
        "name": "Bennett Cleaning Services",
        "link": "https://www.bennettcleaningservices.com.au/",
        "id": 0,
        "info": 
            [
                {
                    "title": "Project Description",
                    "image": "./images/bennett-home.webp",
                    "description": "This project represents the online presence of one of Tasmania's foremost and pioneering cleaning companies. Developed using cutting-edge technologies, including React and Tailwind CSS, the website showcases a blend of innovation and functionality."
                },
                {
                    "title": "Customized animations",
                    "image": "./images/bennett-animations.webp",
                    "description": " Notably, animations created with Framer Motion and React-Tilt contribute to an engaging user experience, while React's capabilities, along with custom UI components, ensure seamless navigation. Through this platform, the company's leadership and significance within the cleaning industry are effectively communicated, reflecting a commitment to excellence and user satisfaction."
                },
                {
                    "title": "Services showcase",
                    "image": "./images/bennett-carousel.webp",
                    "description": "Compilation aimed at highlighting pertinent tasks. By strategically integrating relevant keywords, we optimize the site's positioning on Google. To further engage users, a meticulously crafted image carousel takes center stage. This carousel showcases a curated selection of images portraying our professional cleaning services in action. These images not only captivate users but also provide a visual testament to the quality of our cleaning expertise."
                },
                {
                    "title": "Blog, Tips and News section",
                    "image": "./images/bennett-blog.webp",
                    "description": "Our dynamic Blog section utilizes React-dom's variable routing to offer visitors a seamless experience as they explore a diverse range of articles. Leveraging real-time database integration, the selected article's content is fetched and presented in a component format, ensuring up-to-date and relevant information. This innovative approach creates a user-centric space for cleaning tips, industry insights, and guides, providing an engaging and informative platform for our audience."
                }
            ]
    },
    {
        "name": "Afre Cleaning Services",
        "link": "https://www.afrecleaning.com.au/",
        "id": 1,
        "info": 
            [
                {
                    "title": "Project Description",
                    "image": "./images/afre-home.webp",
                    "description": "This project incorporates modern web development practices, including the use of TypeScript for type safety and Vite.js for fast and efficient development. It also leverages Tailwind CSS for responsive and customizable styling. The application showcases the use of UI components, routing, API integrations, and other features to create an interactive and engaging user experience."
                },
                {
                    "title": "Customized design",
                    "image": "./images/afre-design.webp",
                    "description": "The web application showcases a meticulously crafted design created by a skilled professional using Figma. The development process involved close collaboration and effective teamwork between the designer and developer to bring the project to life and meet the unique needs of the client."
                },
                {
                    "title": "Blog managed with a CMS",
                    "image": "./images/afre-blog.webp",
                    "description": "The project involved the implementation of a dynamic blog section, empowering the client to have full control over content management. Leveraging Contentful, a robust and intuitive Content Management System, the client gains the ability to effortlessly create, edit, and remove articles to align with their marketing objectives."
                },
                {
                    "title": "SEO optimization",
                    "image": "./images/afre-seo.webp",
                    "description": "The website is meticulously optimized for search engines, adhering to best practices in SEO and accessibility. By incorporating structured data that aligns with Google's standards, the website enhances its visibility in search results, enabling clients to find it more effectively and improving its overall positioning."
                },
                {
                    "title": "Web analytics",
                    "image": "./images/afre-analytics.webp",
                    "description": "The website seamlessly integrates with Google Analytics, utilizing the latest GA4 procedures and standards. Through this integration, comprehensive data is collected, including page visits, user clicks, popular blog articles, and conversion tracking. These insights are tailored to meet the specific requirements and requests of the client, enabling informed decision-making and effective analysis of user behavior."
                },
                {
                    "title": "Restful API for quotes processing",
                    "image": "./images/afre-email.webp",
                    "description": "Implementation of a powerful REST API to handle and process quote forms submitted by users on the website. When a form is submitted, customers receive automated responses with beautifully designed emails tailored to their needs. This streamlined process ensures effective communication and delivers a personalized experience to customers."
                }
            ]
    },
    {
        "name": "The Ever Cake",
        "link": "https://dev.db61t1u90mry8.amplifyapp.com/",
        "id": 2,
        "info": 
            [
                {
                    "title": "Project Description",
                    "image": "./images/the-ever-home1.webp",
                    "description": "Full stack web application built with React JS, Tailwind CSS, Redux Toolkit and Node JS. Integration with Stripe (payment gateway), and back-end processes are made with serverless solutions using AWS resources (Lambda functions, REST APIs and Amplify)."
                },
                {
                    "title": "Online shop",
                    "image": "./images/online-shop.webp",
                    "description": "The website has an online shop where the customers can check all the products available and select the preferred size, according to the prices and number of portions. Products' data stored in a .json file for easier management and quicker setup. The shop uses React as a front-end framework and Redux to manage the application's state."
                },
                {
                    "title": "Shopping cart",
                    "image": "./images/shopping-cart.webp",
                    "description": "All selected products are stored in the shopping cart. Here, the users can review the number of items added with their price, and decide if they want to modify the order, clear the cart or proceed to checkout."
                },
                {
                    "title": "Checkout",
                    "image": "./images/checkout.webp",
                    "description": "Customers can give a final review to their order with its final price. The application asks for their contact details and the delivery date of the products (min. 5 days). The application uses Stripe as a payment gateway. The user receives a notification at the top of the page once the transaction has been confirmed."
                },
                {
                    "title": "Email",
                    "image": "./images/email.webp",
                    "description": "The business' owner and the customer will receive an email with the order summary and the tax invoice, with an unique ID generated by the web application once an order has been placed. The process is done by a Lambda function that sends the email through AWS SES."
                },
                {
                    "title": "Data storing",
                    "image": "./images/dynamo1.webp",
                    "description": "A Dynamo DB (a fully managed NoSQL database service provided by AWS) receives the orders' details through a Lambda Function and stores it, in such a way the business owner can use this information to check the orders history and filter it by periods of time, flavours, sizes, etc., providing useful information and guidelines for marketing purposes."
                }
            ]
    },
    {
        "name": "A&A Services",
        "link": "https://www.anacleaningandlaundry.com/",
        "id": 4,
        "info": 
            [
                {
                    "title": "Project Description",
                    "image": "./images/logoAnA.webp",
                    "description": "The project aims to create a comprehensive digital presence for a small tasmanian business, which includes a digital image, social media, logo, branding, and website. It started with the analysis of the business goals, target audience, and current branding."
                },
                {
                    "title": "Business website",
                    "image": "./images/anawebsite1.webp",
                    "description": "This website is a modern, responsive, and high-performing web application built using React JS, Tailwind CSS, Vite, and AWS for the backend. The website is designed to provide a seamless user experience while leveraging the latest web technologies."
                },
                {
                    "title": "Efficient web performance",
                    "image": "./images/services.webp",
                    "description": "By conditionally rendering components, this website reduces the amount of unnecessary rendering that takes place while explaining the services with description and fees, which also improves the performance of the application (this is because React only updates the components that have changed, rather than re-rendering the entire component tree)."
                },
                {
                    "title": "Serverless Architecture",
                    "image": "./images/anaform.webp",
                    "description": "Website form where data submitted by users is processed by AWS Lambda functions. The function receives the form data and processes it sending an email to the business workmail account with the quote request details."
                },
                {
                    "title": "Google Business Account",
                    "image": "./images/ana-account.webp",
                    "description": "Creation and set up of Google My Business Account, which allows the business to manage its online presence on Google Search and Google Maps, receive reviews from clients, and make it easier for customers to find the company on the web."
                }
            ]
    },
    {
        "name": "2 Hands Services",
        "link": "https://2handsservices.com/",
        "id": 3,
        "info": 
            [
                {
                    "title": "Project Description",
                    "image": "./images/two-hands-home1.webp",
                    "description": "Typescript-based React application using Vite. Easy to navigate and provides all the necessary information about the company."
                },
                {
                    "title": "Company's values and services",
                    "image": "./images/values1.webp",
                    "description": "Display of the company's mission, values and services in a clear and professional way to engage leads and customers."
                },
                {
                    "title": "Quotes processing",
                    "image": "./images/form.webp",
                    "description": "All questions, enquiries, quotes and communications made from the website are processed. Captcha integration and small math test to receive only genuine enquiries. A notification via Amazon SES to company's email is sent every time someone submits a form."
                },
                {
                    "title": "Workmail",
                    "image": "./images/workmail.webp",
                    "description": "Creation of Amazon workmail (cloud-based email and calendaring service) account for business operators. Assisstance in the set up of the accounts and introduction of usage and benefits."
                }
            ]
    }
]